Revit 2027 API
ParameterTypeId.StairsRailingAngledConnection Property
 "Angled Joins"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsRailingAngledConnection { get; }
Public Shared ReadOnly Property StairsRailingAngledConnection As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsRailingAngledConnection {
	ForgeTypeId^ get ();
}
static member StairsRailingAngledConnection : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace